In [1]:
import pandas as pd
datos = {
    "producto": ["Helado Vainilla", "Helado Chocolate", None, "Helado Mango"],
    "precio":  [150, None, 160, 170],
    "ventas": [20, 35, None, 30]
}

df= pd.DataFrame(datos)
df

           producto  precio  ventas
0   Helado Vainilla   150.0    20.0
1  Helado Chocolate     NaN    35.0
2              None   160.0     NaN
3      Helado Mango   170.0    30.0

In [2]:
df.isnull()

   producto  precio  ventas
0     False   False   False
1     False    True   False
2      True   False    True
3     False   False   False

In [3]:
df.isnull().sum()

producto    1
precio      1
ventas      1
dtype: int64

In [4]:
df_limpio = df.dropna()
df_limpio

          producto  precio  ventas
0  Helado Vainilla   150.0    20.0
3     Helado Mango   170.0    30.0

In [5]:
df_relleno = df.fillna(0)
df_relleno

           producto  precio  ventas
0   Helado Vainilla   150.0    20.0
1  Helado Chocolate     0.0    35.0
2                 0   160.0     0.0
3      Helado Mango   170.0    30.0